In [2]:
import pandas as pd
import numpy as np

In [3]:
# create sample data: list method
carLoans = [[1, 34689.96, 687.23, 202.93, 484.3, 34205.66, 60, 0.0702,'Toyota Sienna'],
           [2, 34205.66, 687.23, 200.1, 487.13, 33718.53, 60, 0.0702,'Toyota Sienna'],
           [3, 33718.53, 687.23, 197.25, 489.98, 33228.55, 60, 0.0702,'Toyota Sienna'],
           [4, 33228.55, 687.23, 194.38, 492.85, 32735.7, 60, 0.0702,'Toyota Sienna'],
           [5, 32735.7, 687.23, 191.5, 495.73, 32239.97, 60, 0.0702,'Toyota Sienna']]

colNames = ['Month',
            'Starting Balance',
            'Repayment',
            'Interest Paid',
            'Principal Paid',
            'New Balance',
            'term',
            'interest_rate',
            'car_type']

In [4]:
df = pd.DataFrame(data=carLoans, columns=colNames)
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [5]:
# create sample data: numpy array method
carLoans = np.array([
                  [1, 34689.96, 687.23, 202.93, 484.3, 34205.66, 60, 0.0702,'Toyota Sienna'],
                  [2, 34205.66, 687.23, 200.1, 487.13, 33718.53, 60, 0.0702,'Toyota Sienna'],
                  [3, 33718.53, 687.23, 197.25, 489.98, 33228.55, 60, 0.0702,'Toyota Sienna'],
                  [4, 33228.55, 687.23, 194.38, 492.85, 32735.7, 60, 0.0702,'Toyota Sienna'],
                  [5, 32735.7, 687.23, 191.5, 495.73, 32239.97, 60, 0.0702,'Toyota Sienna']
                 ])
   
colNames = ['Month',
            'Starting Balance',
            'Repayment',
            'Interest Paid',
            'Principal Paid',
            'New Balance',
            'term',
            'interest_rate',
            'car_type']

df = pd.DataFrame(data = carLoans, columns=colNames)
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.3,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.1,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.7,60,0.0702,Toyota Sienna
4,5,32735.7,687.23,191.5,495.73,32239.97,60,0.0702,Toyota Sienna

In [6]:
# create sample data: Python Dictionary
carLoans = {'Month': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
             'Starting Balance': {0: 34689.96,1: 34205.66,2: 33718.53,3: 33228.55,4: 32735.7},
             'Repayment': {0: 687.23, 1: 687.23, 2: 687.23, 3: 687.23, 4: 687.23},
             'Interest Paid': {0: 202.93, 1: 200.1, 2: 197.25, 3: 194.38, 4: 191.5},
             'Principal Paid': {0: 484.3, 1: 487.13, 2: 489.98, 3: 492.85, 4: 495.73},
             'New Balance': {0: 34205.66,1: 33718.53,2: 33228.55,3: 32735.7,4: 32239.97},
             'term': {0: 60, 1: 60, 2: 60, 3: 60, 4: 60},
             'interest_rate': {0: 0.0702, 1: 0.0702, 2: 0.0702, 3: 0.0702, 4: 0.0702},
             'car_type': {0: 'Toyota Sienna',1: 'Toyota Sienna',2: 'Toyota Sienna',3: 'Toyota Sienna',4: 'Toyota Sienna'}}

df = pd.DataFrame(data = carLoans, columns=colNames)
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [7]:
student_grades = {'John': {'math': 'A', 'phys': 'B', 'bio': 'C'},
                    'Jane': {'math': 'B', 'phys': 'A', 'bio': 'D'},
                    'Bob': {'math': 'B', 'phys': 'B', 'bio': 'D'},
                    'Alice': {'math': 'A', 'phys': 'D', 'bio': 'C'},
                    'Tim': {'math': 'B', 'phys': 'A', 'bio': 'B'}}

df = pd.DataFrame(data=student_grades)
df

     John Jane Bob Alice Tim
math    A    B   B     A   B
phys    B    A   B     D   A
bio     C    D   D     C   B

In [8]:
df.to_numpy()

array([['A', 'B', 'B', 'A', 'B'],
       ['B', 'A', 'B', 'D', 'A'],
       ['C', 'D', 'D', 'C', 'B']], dtype=object)

In [9]:
df.to_dict()

{'John': {'math': 'A', 'phys': 'B', 'bio': 'C'},
 'Jane': {'math': 'B', 'phys': 'A', 'bio': 'D'},
 'Bob': {'math': 'B', 'phys': 'B', 'bio': 'D'},
 'Alice': {'math': 'A', 'phys': 'D', 'bio': 'C'},
 'Tim': {'math': 'B', 'phys': 'A', 'bio': 'B'}}

In [10]:
df.to_csv(path_or_buf='student_grades.csv', index=False)

In [11]:
%pip install openpyxl

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (3.0.7)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [12]:
df.to_excel(excel_writer='student_grades.xlsx', index=False)

In [13]:
df.values

array([['A', 'B', 'B', 'A', 'B'],
       ['B', 'A', 'B', 'D', 'A'],
       ['C', 'D', 'D', 'C', 'B']], dtype=object)

In [14]:
df.head()

     John Jane Bob Alice Tim
math    A    B   B     A   B
phys    B    A   B     D   A
bio     C    D   D     C   B

In [16]:
df[['John', 'Jane']].head()

     John Jane
math    A    B
phys    B    A
bio     C    D

In [17]:
filter = df['John'] == 'A'
print(df[filter])

     John Jane Bob Alice Tim
math    A    B   B     A   B

In [18]:
print(df.loc[filter, :])

     John Jane Bob Alice Tim
math    A    B   B     A   B

In [19]:
df['John'].sum()

'ABC'

In [20]:
help(pd.DataFrame.string)

AttributeError: type object 'DataFrame' has no attribute 'string'

In [ ]:
# in a pandas dataframe, a row represents a single observation and a column